import React, { Component } from 'react'
import { Card, Checkbox, Button } from 'antd';
import { withRouter } from "react-router-dom";
const liff = window.liff;
export class Consent extends Component {

    handleLogin = () => {
        this.props.history.push("/login")
    }

    mainFunc = async () => {
        await liff.init({ liffId: "1567210612-2vnmZpqo" })
        // document.getElementById("isLoggedIn").append(liff.isLoggedIn())
        if (liff.isLoggedIn) {
            console.log("login success")
            this.getEnvironment()
            this.getUserProfile()
        } else {
            liff.login()
            console.log("login unsuccess")
        }
    }

    getEnvironment = () => {
        console.log("OS: "+liff.getOS())
        console.log("Language: "+liff.getLanguage())
        console.log("Version: "+liff.getVersion())
        console.log("AccessToken: "+liff.getAccessToken())
    }

    getUserProfile = () => {
        console.log("UserID: "+liff.getProfile.userId)
        console.log("UserDisplayName: "+liff.getProfile.displayName)
        // console.log("UserEmail: "+liff.getDecodedIDToken().email)
    }

    componentDidMount() {
        this.mainFunc()
    }
    
    render() {
        return (
            <div>
                <p style={{display:'flex', justifyContent:'center'}}>ข้อกำหนดและเงื่อนไขในการใช้งาน</p>
            <div>
                <Card style={{ border: '1px solid black', display:'flex', justifyContent:'center' }}>
                    <p>1. คำนิยาม


คำและข้อความต่อไปนี้จะมีความหมายตามที่กำหนดไว้ด้านล่างนี้เมื่อมีการใช้ในข้อกำหนดและเงื่อนไขฯ<br />
1.1 "เนื้อหา" หมายถึง ข้อมูล เช่น ข้อความ ไฟล์เสียง เพลง รูปภาพ วิดีโอ ซอฟต์แวร์ โปรแกรม รหัสคอมพิวเตอร์ และสิ่งอื่นๆ ที่คล้ายคลึงกัน<br />
1.2 "เนื้อหาฯ" หมายถึง เนื้อหาที่สามารถเข้าถึงได้ผ่านทางบริการฯ<br />
1.3 "เนื้อหาจากผู้ใช้" หมายถึง เนื้อหาที่ผู้ใช้ได้ส่ง ส่งผ่าน หรือ อัพโหลด<br />
1.4 "เหรียญ" หมายถึง สกุลเงินเสมือนจริงซึ่งผู้ใช้สามารถใช้เพื่อชำระเงินสำหรับเนื้อหาและบริการต่างๆ ที่บริษัทฯ เสนอ ซึ่งมีค่าบริการ<br />
1.5 "ข้อกำหนดและเงื่อนไขฯ เพิ่มเติม" หมายถึง เอกสารที่บริษัทฯ ออกหรืออัพโหลดซึ่งเกี่ยวกับบริการฯ ภายใต้ชื่อ "ข้อตกลง" "แนวทางปฏิบัติ" "นโยบาย" และอื่นๆ ในทำนองเดียวกัน<br /></p>
                    <p>2. การตกลงยอมรับข้อกำหนดและเงื่อนไขฯ


2.1 ผู้ใช้ทุกรายจะต้องใช้บริการฯ ตามข้อกำหนดที่ระบุไว้ในข้อกำหนดและเงื่อนไขฯ ผู้ใช้จะไม่สามารถใช้บริการฯ ได้เว้นเสียแต่ว่า ผู้ใช้ได้ตกลงยอมรับข้อกำหนดและเงื่อนไขฯ การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้<br />
2.2 ผู้เยาว์สามารถใช้บริการฯ ได้ต่อเมื่อได้รับความยินยอมจากบิดามารดาหรือผู้ปกครองตามกฎหมายเท่านั้น นอกจากนี้ หากผู้ใช้ใช้บริการฯ แทน หรือ เพื่อวัตถุประสงค์ขององค์กรธุรกิจใดๆ จะถือว่า องค์กรธุรกิจดังกล่าวได้ตกลงยอมรับข้อกำหนดและเงื่อนไขฯ นี้ด้วยแล้ว การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้<br />
2.3 การที่ผู้ใช้ใช้บริการฯ ถือว่า ผู้ใช้ได้ตกลงยอมรับข้อกำหนดและเงื่อนไขฯ การตกลงยอมรับดังกล่าวมีผลสมบูรณ์และเพิกถอนมิได้<br />
2.4 หากมีข้อกำหนดและเงื่อนไขฯ เพิ่มเติมสำหรับบริการฯ ผู้ใช้จะต้องปฏิบัติตามข้อกำหนดและเงื่อนไขฯ เพิ่มเติมนั้นด้วยเช่นเดียวกับข้อกำหนดและเงื่อนไขฯ นี้<br /></p>
                    <p>3. การแก้ไขข้อกำหนดและเงื่อนไขฯ


บริษัทฯ อาจแก้ไขข้อกำหนดและเงื่อนไขฯ หรือ ข้อกำหนดและเงื่อนไขฯ เพิ่มเติม เมื่อบริษัทฯ เห็นว่ามีความจำเป็น โดยไม่ต้องให้คำบอกกล่าวล่วงหน้าแก่ผู้ใช้ การแก้ไขจะมีผลบังคับเมื่อมีการประกาศข้อกำหนดและเงื่อนไขฯ ที่แก้ไข หรือข้อกำหนดและเงื่อนไขฯ เพิ่มเติมที่แก้ไขไว้ในสถานที่ที่เหมาะสมภายในเว็บไซต์ที่บริษัทฯ เป็นผู้ดำเนินงาน การที่ผู้ใช้ใช้บริการฯ ต่อไป ถือว่าผู้ใช้ได้ให้การยอมรับที่มีผลสมบูรณ์และเพิกถอนมิได้ต่อข้อกำหนดและเงื่อนไขฯ ที่แก้ไขแล้ว หรือข้อกำหนดและเงื่อนไขฯ เพิ่มเติมที่แก้ไขแล้ว ผู้ใช้ควรตรวจสอบข้อกำหนดและเงื่อนไขฯ เป็นประจำระหว่างการใช้บริการฯ เนื่องจากอาจไม่มีการแจ้งเตือนแยกต่างหากเกี่ยวกับการแก้ไขข้อกำหนดและเงื่อนไขฯ ดังกล่าว</p>
                    
                    <div style={{display:'flex', justifyContent:'space-between'}}>
                        <Checkbox >ยอมรับข้อตกลงเเละเงื่อนไข</Checkbox>
                        <Button onClick={this.handleLogin} type="primary">ยืนยัน</Button>
                    </div>
                </Card>
            </div>
            </div>
        )
    }
}

export default withRouter(Consent)
